app/controllers/home_controller.rb

  def index
    @ip = Request.create!(ip: request.remote_ip)
    @ips = Request.all
---
INSERT INTO `requests` (`ip`, `created_at`, `updated_at`) VALUES ('172.20.0.1', '2017-11-14 07:32:14', '2017-11-14 07:32:14')
SELECT `requests`.* FROM `requests`